Repository: realdavian/GateAway
Catalog: GateAway/Resources/*.lproj/Localizable.strings
Languages: ms

source: Cancel
ms: Batal

source: Connect
ms: Sambung

source: Disconnect
ms: Putuskan

source: Close
ms: Tutup

source: Remove
ms: Buang

source: Refresh
ms: Muat Semula

source: Settings
ms: Tetapan

source: Settings…
ms: Tetapan…

source: Quit
ms: Keluar

source: Retry
ms: Cuba Lagi

source: Switch
ms: Tukar

source: Connected
ms: Disambung

source: Connecting
ms: Menyambung

source: Connecting...
ms: Menyambung...

source: Disconnected
ms: Diputuskan

source: Disconnecting
ms: Memutuskan

source: Disconnecting...
ms: Memutuskan...

source: Reconnecting
ms: Menyambung Semula

source: Not Connected
ms: Tidak Disambung

source: Overview
ms: Gambaran Keseluruhan

source: Servers
ms: Pelayan

source: Monitoring
ms: Pemantauan

source: Security
ms: Keselamatan

source: Blacklist
ms: Senarai Hitam

source: Refresh Server List
ms: Muat Semula Senarai Pelayan

source: Connect (Best)
ms: Sambung (Terbaik)

source: ⏹ Stop Connecting
ms: ⏹ Berhenti Menyambung

source: Best by Country
ms: Terbaik mengikut Negara

source: Connection Status
ms: Status Sambungan

source: Network Statistics
ms: Statistik Rangkaian

source: Downloaded
ms: Dimuat Turun

source: Uploaded
ms: Dimuat Naik

source: Download Speed
ms: Kelajuan Muat Turun

source: Upload Speed
ms: Kelajuan Muat Naik

source: Technical Details
ms: Butiran Teknikal

source: Protocol
ms: Protokol

source: Cipher
ms: Sifer

source: Connected Since
ms: Disambung Sejak

source: Connect to a VPN server to see real-time statistics
ms: Sambung ke pelayan VPN untuk melihat statistik masa nyata

source: Search by country, IP, or hostname
ms: Cari mengikut negara, IP, atau nama hos

source: Sort by
ms: Susun mengikut

source: Country
ms: Negara

source: Speed
ms: Kelajuan

source: Score
ms: Skor

source: Actions
ms: Tindakan

source: Loading servers...
ms: Memuatkan pelayan...

source: No servers available
ms: Tiada pelayan tersedia

source: Connect to Server?
ms: Sambung ke Pelayan?

source: Connect to %@ (%@)?
ms: Sambung ke %@ (%@)?

source: Switch Server?
ms: Tukar Pelayan?

source: You are currently connected. Switch to %@ (%@)?
ms: Anda sedang disambung. Tukar ke %@ (%@)?

source: Connection Failed
ms: Sambungan Gagal

source: Remove from Blacklist?
ms: Buang daripada Senarai Hitam?

source: Remove %@ (%@) from blacklist?
ms: Buang %@ (%@) daripada senarai hitam?

source: Add Server
ms: Tambah Pelayan

source: No Blacklisted Servers
ms: Tiada Pelayan Senarai Hitam

source: Servers you blacklist will appear here
ms: Pelayan yang anda senarai hitamkan akan muncul di sini

source: Hostname
ms: Nama Hos

source: Added
ms: Ditambah

source: Expires
ms: Tamat Tempoh

source: Auto-cleanup expired
ms: Pembersihan automatik tamat tempoh

source: VPN Credentials
ms: Kredensial VPN

source: VPNGate servers use default credentials. These work for all VPNGate servers.
ms: Pelayan VPNGate menggunakan kredensial lalai. Ini berfungsi untuk semua pelayan VPNGate.

source: Username
ms: Nama Pengguna

source: Password
ms: Kata Laluan

source: Note: These are the default VPNGate credentials and cannot be changed.
ms: Nota: Ini adalah kredensial VPNGate lalai dan tidak boleh diubah.

source: Biometric Authentication
ms: Pengesahan Biometrik

source: Touch ID for VPN Connections
ms: Touch ID untuk Sambungan VPN

source: Password stored securely in Keychain
ms: Kata laluan disimpan dengan selamat dalam Keychain

source: Store admin password for Touch ID authentication
ms: Simpan kata laluan admin untuk pengesahan Touch ID

source: Enabled
ms: Didayakan

source: Disabled
ms: Dilumpuhkan

source: Enable Touch ID...
ms: Dayakan Touch ID...

source: Test Touch ID...
ms: Uji Touch ID...

source: Touch ID Test Result
ms: Hasil Uji Touch ID

source: Remove...
ms: Buang...

source: Protection
ms: Perlindungan

source: Kill Switch
ms: Suis Mati

source: Block internet if VPN disconnects unexpectedly
ms: Sekat internet jika VPN terputus tanpa dijangka

source: Blocks ALL traffic when VPN drops
ms: Sekat SEMUA trafik apabila VPN terputus

source: IPv6 Leak Protection
ms: Perlindungan Kebocoran IPv6

source: Disable IPv6 to prevent identity leaks
ms: Lumpuhkan IPv6 untuk mengelakkan kebocoran identiti

source: Auto-Reconnect
ms: Sambung Semula Automatik

source: Automatically reconnect if VPN connection drops
ms: Sambung semula secara automatik jika sambungan VPN terputus

source: Server List Cache
ms: Cache Senarai Pelayan

source: Cache TTL
ms: TTL Cache

source: How long to keep the server list cached before refreshing.
ms: Berapa lama senarai pelayan disimpan dalam cache sebelum dimuat semula.

source: Clear Cache
ms: Kosongkan Cache

source: No cached data
ms: Tiada data cache

source: GateAway wants to store your password
ms: GateAway mahu menyimpan kata laluan anda

source: Enter your administrator password to enable Touch ID for VPN connections. Your password will be securely stored in the macOS Keychain.
ms: Masukkan kata laluan pentadbir anda untuk mendayakan Touch ID bagi sambungan VPN. Kata laluan anda akan disimpan dengan selamat dalam macOS Keychain.

source: Enable Touch ID
ms: Dayakan Touch ID

source: Password:
ms: Kata Laluan:

source: Enter your administrator password
ms: Masukkan kata laluan pentadbir anda

source: This is the password you use for sudo commands.
ms: Ini adalah kata laluan yang anda gunakan untuk araun sudo.

source: Incorrect Password
ms: Kata Laluan Salah

source: The password you entered is incorrect. Please try again.
ms: Kata laluan yang anda masukkan adalah salah. Sila cuba lagi.

source: Try Again
ms: Cuba Lagi

source: Failed to Save Password
ms: Gagal Menyimpan Kata Laluan

source: Add to Blacklist
ms: Tambah ke Senarai Hitam

source: Select Server
ms: Pilih Pelayan

source: Select a server...
ms: Pilih pelayan...

source: Reason (Optional)
ms: Sebab (Pilihan)

source: Expires After
ms: Tamat Tempoh Selepas

source: e.g., Too slow, Connection failed
ms: cth., Terlalu perlahan, Sambungan gagal

source: 1 Hour
ms: 1 Jam

source: 2 Hours
ms: 2 Jam

source: 8 Hours
ms: 8 Jam

source: 1 Day
ms: 1 Hari

source: 7 Days
ms: 7 Hari

source: Never
ms: Tidak Pernah

source: No servers available. Refresh the server list from the Servers tab.
ms: Tiada pelayan tersedia. Muat semula senarai pelayan dari tab Pelayan.

source: Establishing tunnel...
ms: Menubuhkan terowong...

source: Connection Statistics
ms: Statistik Sambungan

source: Success Rate
ms: Kadar Kejayaan

source: Avg Connection Time
ms: Purata Masa Sambungan

source: Total Attempts: %d
ms: Jumlah Percubaan: %d

source: %d successful
ms: %d berjaya

source: Download
ms: Muat Turun

source: Upload
ms: Muat Naik

source: VPN Backend
ms: Bahagian Belakang VPN

source: OpenVPN CLI
ms: CLI OpenVPN

source: Installed • Version %@
ms: Dipasang • Versi %@

source: Not Installed
ms: Tidak Dipasang

source: Install
ms: Pasang

source: Requires Homebrew package manager
ms: Memerlukan pengurus pakej Homebrew

source: Install Homebrew?
ms: Pasang Homebrew?

source: OpenVPN requires Homebrew package manager. Would you like to install both Homebrew and OpenVPN?
ms: OpenVPN memerlukan pengurus pakej Homebrew. Adakah anda ingin memasang kedua-dua Homebrew dan OpenVPN?

source: Install Both
ms: Pasang Kedua-duanya

source: Stop
ms: Berhenti

source: Reason:
ms: Sebab:

source: Remove from Blacklist
ms: Buang daripada Senarai Hitam

source: Enable Touch ID for VPN
ms: Dayakan Touch ID untuk VPN

source: Your admin password will be securely stored
ms: Kata laluan pentadbir anda akan disimpan dengan selamat

source: Admin Password
ms: Kata Laluan Pentadbir

source: The password you use for 'sudo' commands
ms: Kata laluan yang anda gunakan untuk arahan 'sudo'

source: Running...
ms: Sedang berjalan...

source: Run
ms: Jalankan

source: No servers
ms: Tiada pelayan

source: Refresh Failed
ms: Muat Semula Gagal

source: Disconnection Failed
ms: Pemutusan Gagal

source: Success
ms: Berjaya

source: Failed
ms: Gagal

source: 1 hour
ms: 1 jam

source: About
ms: Mengenai

source: 2 hours
ms: 2 jam

source: 24 hours
ms: 24 jam

source: Backend
ms: Bahagian Belakang

source: Encryption
ms: Penyulitan

source: DNS leak protection enabled via OpenVPN
ms: Perlindungan kebocoran DNS didayakan melalui OpenVPN

source: Blacklisted
ms: disenarai hitam

source: Copy to clipboard
ms: Salin ke papan keratan

source: Refresh server list from API
ms: Muat semula senarai pelayan dari API

source: %dm ago
ms: %d minit yang lalu

source: %d servers
ms: %d pelayan

source: %d Blacklisted Servers
ms: %d Pelayan Senarai Hitam

source: Cache expired %d min ago
ms: Cache tamat tempoh %d minit yang lalu

source: Last updated %d min ago
ms: Terakhir dikemas kini %d minit yang lalu

source: Servers: %d
ms: Pelayan: %d

source: Updated: %@
ms: Dikemas kini: %@

source: Administrator Password Required
ms: Kata Laluan Pentadbir Diperlukan

source: GateAway needs your password to connect to VPN.
ms: GateAway memerlukan kata laluan anda untuk menyambung ke VPN.

source: Enter your password
ms: Masukkan kata laluan anda

source: VPN backend not available: %@
ms: Backend VPN tidak tersedia: %@

source: Connection failed: %@
ms: Sambungan gagal: %@

source: Disconnection failed: %@
ms: Pemutusan gagal: %@

source: Invalid configuration: %@
ms: Konfigurasi tidak sah: %@

source: Authentication required. Please configure Touch ID or enter your password.
ms: Pengesahan diperlukan. Sila konfigurasikan Touch ID atau masukkan kata laluan anda.

source: Permission denied. Administrator privileges required.
ms: Izin ditolak. Keistimewaan pentadbir diperlukan.

source: Connection timed out. Please try again.
ms: Sambungan tamat masa. Sila cuba lagi.

source: Install the required VPN software using Homebrew.
ms: Pasang perisian VPN yang diperlukan menggunakan Homebrew.

source: Enable Touch ID in Settings → Authentication.
ms: Dayakan Touch ID dalam Tetapan → Pengesahan.

source: Grant administrator privileges when prompted.
ms: Berikan keistimewaan pentadbir apabila diminta.

source: Try a different server or check your internet connection.
ms: Cuba pelayan lain atau semak sambungan internet anda.

source: Failed to save password: %@
ms: Gagal menyimpan kata laluan: %@

source: Failed to retrieve password: %@
ms: Gagal mendapatkan kata laluan: %@

source: Touch ID authentication was cancelled
ms: Pengesahan Touch ID dibatalkan

source: Touch ID is not available on this device
ms: Touch ID tidak tersedia pada peranti ini

source: No password stored in Keychain
ms: Tiada kata laluan disimpan dalam Rantai Kunci

source: Command failed: %@
ms: Arahan gagal: %@

source: Authentication required for privileged operation
ms: Pengesahan diperlukan untuk operasi istimewa

source: Invalid password format
ms: Format kata laluan tidak sah

source: OpenVPN is not installed. Please install it via Settings.
ms: OpenVPN tidak dipasang. Sila pasang melalui Tetapan.

source: Failed to create OpenVPN configuration file.
ms: Gagal mencipta fail konfigurasi OpenVPN.

source: VPN connection failed: %@
ms: Sambungan VPN gagal: %@

source: VPN disconnection failed: %@
ms: Pemutusan VPN gagal: %@

source: Permission denied. OpenVPN requires administrator privileges.
ms: Izin ditolak. OpenVPN memerlukan keistimewaan pentadbir.

source: %@ authentication successful!
ms: %@ pengesahan berjaya!

source: Failed: %@
ms: Gagal: %@

source: Failed to remove password: %@
ms: Gagal membuang kata laluan: %@
